/*********************************************************************************************************
**
**                                    中国软件开源组织
**
**                                   嵌入式实时操作系统
**
**                                SylixOS(TM)  LW : long wing
**
**                               Copyright All Rights Reserved
**
**--------------文件信息--------------------------------------------------------------------------------
**
** 文   件   名: lwip_if.h
**
** 创   建   人: Han.Hui (韩辉)
**
** 文件创建日期: 2014 年 05 月 02 日
**
** 描        述: netif lock 接口.
*********************************************************************************************************/

#ifndef __LWIP_IF_H
#define __LWIP_IF_H

/*********************************************************************************************************
  网络接口锁
*********************************************************************************************************/

#ifndef __NETIF_MAIN_FILE
extern LW_OBJECT_HANDLE     _G_ulNetifLock;
#else
       LW_OBJECT_HANDLE     _G_ulNetifLock;
#endif                                                                  /*  __NETIF_MAIN_FILE           */

#define LWIP_NETIF_LOCK()   API_SemaphoreMPend(_G_ulNetifLock, LW_OPTION_WAIT_INFINITE)
#define LWIP_NETIF_UNLOCK() API_SemaphoreMPost(_G_ulNetifLock)

#endif                                                                  /*  __LWIP_IF_H                 */
/*********************************************************************************************************
  END
*********************************************************************************************************/
