/*********************************************************************************************************
**
**                                    中国软件开源组织
**
**                                   嵌入式实时操作系统
**
**                                SylixOS(TM)  LW : long wing
**
**                               Copyright All Rights Reserved
**
**--------------文件信息--------------------------------------------------------------------------------
**
** 文   件   名: lwip_privatemib.c
**
** 创   建   人: Han.Hui (韩辉)
**
** 文件创建日期: 2010 年 07 月 28 日
**
** 描        述: lwip private mib 接口.
*********************************************************************************************************/
#define  __SYLIXOS_KERNEL
#include "../SylixOS/kernel/include/k_kernel.h"
#include "../SylixOS/system/include/s_system.h"
/*********************************************************************************************************
  裁剪控制
*********************************************************************************************************/
#if LW_CFG_NET_EN > 0
#include "lwip/snmp_structs.h"
/*********************************************************************************************************
  private mib 节点定义
*********************************************************************************************************/
#if LWIP_SNMP > 0
struct mib_array_node   mib_private;
static VOIDFUNCPTR      _G_pfuncPrivateMibInit = LW_NULL;
/*********************************************************************************************************
** 函数名称: __netSnmpPriMibInit
** 功能描述: SNMP SNMP_PRIVATE_MIB_INIT 宏
** 输　入  : NONE
** 输　出  : NONE
** 全局变量: 
** 调用模块: 
*********************************************************************************************************/
VOID  __netSnmpPriMibInit (VOID)
{
    if (_G_pfuncPrivateMibInit) {
        _G_pfuncPrivateMibInit();
    }
}
/*********************************************************************************************************
** 函数名称: API_NetSnmpPriMibGet
** 功能描述: 获取网络系统 SNMP PRIVATE MIB 节点.
** 输　入  : NONE
** 输　出  : PRIVATE MIB 指针
** 全局变量: 
** 调用模块: 
** 注  意  : 返回值需强转为 struct mib_array_node 类型.
             
                                           API 函数
*********************************************************************************************************/
LW_API  
PVOID  API_NetSnmpPriMibGet (VOID)
{
    return  ((PVOID)&mib_private);
}
/*********************************************************************************************************
** 函数名称: API_NetSnmpSetPriMibInitHook
** 功能描述: 设置网络系统 SNMP PRIVATE MIB 节点初始化回调函数.
** 输　入  : pfuncPriMibInit   private mib 初始化函数
** 输　出  : NONE
** 全局变量: 
** 调用模块: 
                                           API 函数
*********************************************************************************************************/
LW_API  
VOID  API_NetSnmpSetPriMibInitHook (VOIDFUNCPTR  pfuncPriMibInit)
{
    _G_pfuncPrivateMibInit = pfuncPriMibInit;
}
#endif                                                                  /*  LWIP_SNMP > 0               */
#endif                                                                  /*  __LWIP_SYLIXOS_H            */
/*********************************************************************************************************
  END
*********************************************************************************************************/
