/*********************************************************************************************************
**
**                                    中国软件开源组织
**
**                                   嵌入式实时操作系统
**
**                                SylixOS(TM)  LW : long wing
**
**                               Copyright All Rights Reserved
**
**--------------文件信息--------------------------------------------------------------------------------
**
** 文   件   名: lwip_nat.h
**
** 创   建   人: Han.Hui (韩辉)
**
** 文件创建日期: 2010 年 03 月 19 日
**
** 描        述: lwip NAT 支持包.
*********************************************************************************************************/

#ifndef __LWIP_NAT_H
#define __LWIP_NAT_H

/*********************************************************************************************************
  裁剪控制
*********************************************************************************************************/
#if (LW_CFG_NET_EN > 0) && (LW_CFG_NET_NAT_EN > 0)

LW_API VOID         API_INetNatInit(VOID);
LW_API INT          API_INetNatStart(CPCHAR  pcLocalNetif, CPCHAR  pcApNetif);
LW_API INT          API_INetNatStop(VOID);

#define inetNatInit     API_INetNatInit
#define inetNatStart    API_INetNatStart
#define inetNatStop     API_INetNatStop

#endif                                                                  /*  LW_CFG_NET_EN > 0           */
                                                                        /*  LW_CFG_NET_NAT_EN > 0       */
#endif                                                                  /*  __LWIP_NAT_H                */
/*********************************************************************************************************
  END
*********************************************************************************************************/
