/*********************************************************************************************************
**
**                                    中国软件开源组织
**
**                                   嵌入式实时操作系统
**
**                                SylixOS(TM)  LW : long wing
**
**                               Copyright All Rights Reserved
**
**--------------文件信息--------------------------------------------------------------------------------
**
** 文   件   名: inlSchedSeek.h
**
** 创   建   人: Han.Hui (韩辉)
**
** 文件创建日期: 2006 年 12 月 14 日
**
** 描        述: 这是系统调度器查询有就绪线程的最高优先级内联函数
*********************************************************************************************************/

#ifndef  __INLSCHEDSEEK_H
#define  __INLSCHEDSEEK_H

/*********************************************************************************************************
  调度器查询有就绪线程的最高优先级内联函数
*********************************************************************************************************/

static LW_INLINE UINT8  _SchedSeekPriority (VOID)
{
    REGISTER UINT8    ucX;
    REGISTER UINT8    ucY;
    REGISTER UINT8    ucZ;
    REGISTER UINT8    ucPriority;
    
    ucZ = _K_ucLsbBitmap[_K_ucThreadReadyBank];
    ucY = _K_ucLsbBitmap[_K_ucThreadReadyGroup[ucZ]];
    ucX = _K_ucLsbBitmap[_K_ucThreadReadyTable[ucZ][ucY]];
    
    ucPriority = (UINT8)((ucZ << 6) + (ucY << 3) + ucX);
    
    return  (ucPriority);
}

#endif                                                                  /*  __INLSCHEDSEEK_H            */
/*********************************************************************************************************
  END
*********************************************************************************************************/
