/*********************************************************************************************************
**
**                                    中国软件开源组织
**
**                                   嵌入式实时操作系统
**
**                                       SylixOS(TM)
**
**                               Copyright  All Rights Reserved
**
**--------------文件信息--------------------------------------------------------------------------------
**
** 文   件   名: k_const.h
**
** 创   建   人: Han.Hui (韩辉)
**
** 文件创建日期: 2006 年 12 月 12 日
**
** 描        述: 这是系统控制常量定义。

** BUG:
2009.07.28  更新对齐内存大小计算方法.
*********************************************************************************************************/

#ifndef  __K_CONST_H
#define  __K_CONST_H

/*********************************************************************************************************
  READY TABLE
*********************************************************************************************************/

#define __BANK_NUM                  4                                   /*  调度表分区数                */
#define __RDY_TBL_SIZE              8                                   /*  就续表位图大小              */

/*********************************************************************************************************
  TCB 的字节数定义，相对于字对齐的字节数
*********************************************************************************************************/

#define __SEGMENT_BLOCK_SIZE_ALIGN  ROUND_UP(sizeof(LW_CLASS_SEGMENT), LW_CFG_HEAP_ALIGNMENT)

#if LW_CFG_COROUTINE_EN > 0
#define __CRCB_SIZE_ALIGN           ROUND_UP(sizeof(LW_CLASS_COROUTINE), sizeof(LW_STACK))
#endif                                                                  /*  LW_CFG_COROUTINE_EN > 0     */

/*********************************************************************************************************
  最小堆栈的字节数
*********************************************************************************************************/

#define __STK_MINMUM_BYTE_SIZE      (ARCH_STK_MIN_WORD_SIZE * sizeof(LW_STACK))

/*********************************************************************************************************
  EVENT WAIT PRIORITY QUEUE
*********************************************************************************************************/

#define __EACH_WAIT_QUEUE_PRIORITY \
        (LW_PRIO_LOWEST / LW_CFG_MAX_EVENT_PRIORITY_Q_SIZE)

/*********************************************************************************************************
  系统状态
*********************************************************************************************************/

#define LW_SYS_STATUS_SET(status)   (_K_ucSysStatus = status)
#define LW_SYS_STATUS_GET()         (_K_ucSysStatus)

#define LW_SYS_STATUS_INIT          0
#define LW_SYS_STATUS_RUNNING       1

#define LW_SYS_STATUS_IS_INIT()     (_K_ucSysStatus == LW_SYS_STATUS_INIT)
#define LW_SYS_STATUS_IS_RUNNING()  (_K_ucSysStatus == LW_SYS_STATUS_RUNNING)

/*********************************************************************************************************
  中断向量表
*********************************************************************************************************/

#define LW_IVEC_GET_IDESC(vector)       \
        (&_K_idescTable[vector])

#define LW_IVEC_GET_FLAG(vector)        \
        (_K_idescTable[vector].IDESC_ulFlag)
        
#define LW_IVEC_SET_FLAG(vector, flag)  \
        (_K_idescTable[vector].IDESC_ulFlag = (flag))
        
/*********************************************************************************************************
  调试等级定义
*********************************************************************************************************/

#define __LOGMESSAGE_LEVEL          1                                   /*  系统运行状态信息            */
#define __ERRORMESSAGE_LEVEL        2                                   /*  系统故障信息                */
#define __ALL_LEVEL                 3                                   /*  所有类型                    */

/*********************************************************************************************************
  CONST
*********************************************************************************************************/

#define PX_ROOT                     '/'
#define PX_STR_ROOT                 "/"
#define PX_DIVIDER                  PX_ROOT
#define PX_STR_DIVIDER              PX_STR_ROOT

#endif                                                                  /*  __K_CONST_H                 */
/*********************************************************************************************************
  END
*********************************************************************************************************/
