/*********************************************************************************************************
**
**                                    中国软件开源组织
**
**                                   嵌入式实时操作系统
**
**                                SylixOS(TM)  LW : long wing
**
**                               Copyright All Rights Reserved
**
**--------------文件信息--------------------------------------------------------------------------------
**
** 文   件   名: armDbg.c
**
** 创   建   人: Han.Hui (韩辉)
**
** 文件创建日期: 2014 年 05 月 14 日
**
** 描        述: ARM 体系构架调试相关.
*********************************************************************************************************/
#define  __SYLIXOS_KERNEL
#include "SylixOS.h"
/*********************************************************************************************************
  裁减配置
*********************************************************************************************************/
#if LW_CFG_GDB_EN > 0
#if LW_CFG_CACHE_EN > 0
#include "../mm/cache/armCacheCommon.h"
#endif                                                                  /*  LW_CFG_CACHE_EN > 0         */
/*********************************************************************************************************
  ARM 断点使用未定义指令异常
*********************************************************************************************************/
#define ARM_BREAKPOINT_INS          0xE7FFDEFE
#define ARM_THUMB_BREAKPOINT_INS    0xDEDE
/*********************************************************************************************************
** 函数名称: archDbgBpInsert
** 功能描述: 插入一个断点.
** 输　入  : ulAddr         断点地址
**           pulIns         返回的之前的指令
** 输　出  : NONE
** 全局变量: 
** 调用模块: 
*********************************************************************************************************/
VOID  archDbgBpInsert (addr_t  ulAddr, ULONG  *pulIns)
{
    *pulIns = *(ULONG *)ulAddr;
    *(ULONG *)ulAddr = ARM_BREAKPOINT_INS;
    
#if LW_CFG_CACHE_EN > 0
    armDCacheFlushMVA((PVOID)ulAddr);
    armICacheInvalidate((PVOID)ulAddr, sizeof(ULONG));
#endif                                                                  /*  LW_CFG_CACHE_EN > 0         */
}
/*********************************************************************************************************
** 函数名称: archDbgBpRemove
** 功能描述: 删除一个断点.
** 输　入  : ulAddr         断点地址
**           pulIns         返回的之前的指令
** 输　出  : NONE
** 全局变量: 
** 调用模块: 
*********************************************************************************************************/
VOID  archDbgBpRemove (addr_t  ulAddr, ULONG  ulIns)
{
    *(ULONG *)ulAddr = ulIns;
    
#if LW_CFG_CACHE_EN > 0
    armDCacheFlushMVA((PVOID)ulAddr);
    armICacheInvalidate((PVOID)ulAddr, sizeof(ULONG));
#endif                                                                  /*  LW_CFG_CACHE_EN > 0         */
}
/*********************************************************************************************************
** 函数名称: archDbgIsBp
** 功能描述: 判断指定位置是否是一个断点.
** 输　入  : ulAddr         断点地址
** 输　出  : LW_TRUE or LW_FALSE
** 全局变量: 
** 调用模块: 
*********************************************************************************************************/
BOOL  archDbgIsBp (addr_t  ulAddr)
{
    if (*(ULONG *)ulAddr == ARM_BREAKPOINT_INS) {
        return  (LW_TRUE);
    } else {
        return  (LW_FALSE);
    }
}
#endif                                                                  /*  LW_CFG_GDB_EN > 0           */
/*********************************************************************************************************
  END
*********************************************************************************************************/
