/**********************************************************************************************************
**
**                                    中国软件开源组织
**
**                                   嵌入式实时操作系统
**
**                                       SylixOS(TM)
**
**                               Copyright  All Rights Reserved
**
**--------------文件信息--------------------------------------------------------------------------------
**
** 文   件   名: armMmuCommon.c
**
** 创   建   人: Han.Hui (韩辉)
**
** 文件创建日期: 2013 年 12 月 09 日
**
** 描        述: ARM 体系架构 MMU 通用函数支持.
*********************************************************************************************************/
#define  __SYLIXOS_KERNEL
#include "SylixOS.h"
#include "armMmuCommon.h"
/*********************************************************************************************************
** 函数名称: armGetAbtAddr
** 功能描述: MMU 系统发生数据访问异常时的地址
** 输　入  : NONE
** 输　出  : 数据异常地址
** 全局变量: 
** 调用模块: 
*********************************************************************************************************/
addr_t  armGetAbtAddr (VOID)
{
#if LW_CFG_VMM_EN > 0
    return  ((addr_t)armMmuAbtFaultAddr());
#else
    return  ((addr_t)0ul);
#endif                                                                  /*  LW_CFG_VMM_EN > 0           */
}
/*********************************************************************************************************
** 函数名称: armGetAbtType
** 功能描述: MMU 系统发生数据访问异常时的类型
** 输　入  : NONE
** 输　出  : 数据异常类型
** 全局变量: 
** 调用模块: 
*********************************************************************************************************/
ULONG   armGetAbtType (VOID)
{
#if LW_CFG_VMM_EN > 0
    UINT32  uiStatus = armMmuAbtFaultStatus() & 0x0f;
    
    if ((uiStatus & 0xC) == 0) {
        return  (LW_VMM_ABORT_TYPE_TERMINAL);                           /*  极端异常访问                */
    
    } else if ((uiStatus == 0xF) ||
               (uiStatus == 0xD)) {                                     /*  访问权限错误                */
        return  (LW_VMM_ABORT_TYPE_WRITE);
    
    } else {
        return  (LW_VMM_ABORT_TYPE_MAP);                                /*  映射错误                    */
    }
#else
    return  (LW_VMM_ABORT_TYPE_TERMINAL);
#endif                                                                  /*  LW_CFG_VMM_EN > 0           */
}
/*********************************************************************************************************
** 函数名称: armGetPreAddr
** 功能描述: MMU 系统发生指令访问异常时的地址
** 输　入  : NONE
** 输　出  : 指令异常地址
** 全局变量: 
** 调用模块: 
*********************************************************************************************************/
addr_t  armGetPreAddr (UINT32  uiRetLr)
{
    return  ((addr_t)(uiRetLr - 4));
}
/*********************************************************************************************************
** 函数名称: armGetPreType
** 功能描述: MMU 系统发生指令访问异常时的类型
** 输　入  : NONE
** 输　出  : 指令异常类型
** 全局变量: 
** 调用模块: 
*********************************************************************************************************/
ULONG   armGetPreType (VOID)
{
#if LW_CFG_VMM_EN > 0
    UINT32  uiStatus = armMmuPreFaultStatus() & 0x0f;
    
    if ((uiStatus & 0xC) == 0) {
        return  (LW_VMM_ABORT_TYPE_TERMINAL);                           /*  极端异常访问                */
    
    } else if ((uiStatus == 0xD) || (uiStatus == 0xF)) {                /*  权限错误                    */
        return  (LW_VMM_ABORT_TYPE_EXEC);
        
    } else {
        return  (LW_VMM_ABORT_TYPE_MAP);                                /*  映射错误                    */
    }
#else
    return  (LW_VMM_ABORT_TYPE_TERMINAL);
#endif                                                                  /*  LW_CFG_VMM_EN > 0           */
}
/*********************************************************************************************************
  END
*********************************************************************************************************/
