/*********************************************************************************************************
**
**                                    中国软件开源组织
**
**                                   嵌入式实时操作系统
**
**                                SylixOS(TM)  LW : long wing
**
**                               Copyright All Rights Reserved
**
**--------------文件信息--------------------------------------------------------------------------------
**
** 文   件   名: ThreadLock.c
**
** 创   建   人: Han.Hui (韩辉)
**
** 文件创建日期: 2006 年 12 月 18 日
**
** 描        述: 任务锁定调度器.

** BUG
2007.11.04  将 0xFFFFFFFF 改为 __ARCH_ULONG_MAX
2008.01.20  将全局锁改为局部锁.
2013.07.18  兼容 SMP 系统.
*********************************************************************************************************/
#define  __SYLIXOS_KERNEL
#include "../SylixOS/kernel/include/k_kernel.h"
/*********************************************************************************************************
** 函数名称: API_ThreadLock
** 功能描述: 任务锁定的调度器, 任务如果不主动退出就绪态, 则会一直运行下去. 
             如果是 SMP 系统, 除非主动让出 CPU, 否则当前任务不会切换到其他 CPU.
** 输　入  : 
** 输　出  : 
** 全局变量: 
** 调用模块: 
** 注  意  : 此 API 仅对当前 CPU 生效, 并不会影响其他 CPU 调度.
                                           API 函数
*********************************************************************************************************/
LW_API
VOID  API_ThreadLock (VOID)
{
    PLW_CLASS_TCB   ptcbCur;
    
    if (!LW_SYS_STATUS_IS_RUNNING()) {                                  /*  系统必须已经启动            */
        _ErrorHandle(ERROR_KERNEL_NOT_RUNNING);
        return;
    }
    
    LW_TCB_GET_CUR_SAFE(ptcbCur);
    
    if (__THREAD_LOCK_GET(ptcbCur) != __ARCH_ULONG_MAX) {
        __THREAD_LOCK_INC(ptcbCur);
    }
    
#if LW_CFG_SMP_EN > 0
    KN_SMP_MB();
#endif                                                                  /*  LW_CFG_SMP_EN               */
    
    _ErrorHandle(ERROR_NONE);
}
/*********************************************************************************************************
  END
*********************************************************************************************************/
