/*********************************************************************************************************
**
**                                    中国软件开源组织
**
**                                   嵌入式实时操作系统
**
**                                SylixOS(TM)  LW : long wing
**
**                               Copyright All Rights Reserved
**
**--------------文件信息--------------------------------------------------------------------------------
**
** 文   件   名: in_system.h
**
** 创   建   人: Han.Hui (韩辉)
**
** 文件创建日期: 2013 年 01 月 19 日
**
** 描        述: include/netinet/in_system .
*********************************************************************************************************/

#ifndef __IN_SYSTM_H
#define __IN_SYSTM_H

#include "sys/types.h"

typedef u_short     n_short;                                            /* short as received from net   */
typedef u_int       n_long;                                             /* long as received from net    */
typedef u_int       n_time;                                             /* ms since 00:00 GMT, byte rev */

#endif                                                                  /*  __IN_SYSTM_H                */
/*********************************************************************************************************
  END
*********************************************************************************************************/
