/*********************************************************************************************************
**
**                                    中国软件开源组织
**
**                                   嵌入式实时操作系统
**
**                                SylixOS(TM)  LW : long wing
**
**                               Copyright All Rights Reserved
**
**--------------文件信息--------------------------------------------------------------------------------
**
** 文   件   名: lwip_vpnnetif.h
**
** 创   建   人: Han.Hui (韩辉)
**
** 文件创建日期: 2010 年 05 月 25 日
**
** 描        述: SSL VPN 虚拟网络接口.
*********************************************************************************************************/

#ifndef __LWIP_VPNLIB_H
#define __LWIP_VPNLIB_H

/*********************************************************************************************************
  VPN 网络接口名
*********************************************************************************************************/

#define __VPN_IFNAME0                          'v'
#define __VPN_IFNAME1                          'p'

/*********************************************************************************************************
  SSL 握手重试次数
*********************************************************************************************************/

#define __VPN_SSL_HANDSHAKE_MAX_TIME            10                      /*  最多的握手次数              */

/*********************************************************************************************************
  VPN 上下文
*********************************************************************************************************/

typedef struct __vpn_context {
    struct netif        VPNCTX_netif;                                   /*  lwip 网络接口               */
    INT                 VPNCTX_iSocket;                                 /*  socket                      */

    havege_state        VPNCTX_haveagestat;                             /*  生成随机数相关              */

    ssl_context         VPNCTX_sslctx;                                  /*  ssl 上下文                  */
    ssl_session         VPNCTX_sslsn;                                   /*  ssl 会话上下文              */

    INT                 VPNCTX_iMode;                                   /*  运行模式  (服务器/客户机)   */
#define __VPN_SSL_CLIENT            SSL_IS_CLIENT
#define __VPN_SSL_SERVER            SSL_IS_SERVER

    INT                 VPNCTX_iVerifyOpt;                              /*  ssl verify option           */

    x509_cert           VPNCTX_x509certCA;                              /*  CA 证书                     */
    x509_cert           VPNCTX_x509certPrivate;                         /*  私有证书                    */

    rsa_context         VPNCTX_rasctx;                                  /*  RSA 上下文                  */
} __VPN_CONTEXT;
typedef __VPN_CONTEXT  *__PVPN_CONTEXT;

#endif                                                                  /*  __LWIP_VPNLIB_H             */
/*********************************************************************************************************
  END
*********************************************************************************************************/
