/*********************************************************************************************************
**
**                                    中国软件开源组织
**
**                                   嵌入式实时操作系统
**
**                                SylixOS(TM)  LW : long wing
**
**                               Copyright All Rights Reserved
**
**--------------文件信息--------------------------------------------------------------------------------
**
** 文   件   名: _ReadyTableInit.c
**
** 创   建   人: Han.Hui (韩辉)
**
** 文件创建日期: 2006 年 12 月 14 日
**
** 描        述: 这是系统就绪表初始化函数库。
*********************************************************************************************************/
#define  __SYLIXOS_KERNEL
#include "../SylixOS/kernel/include/k_kernel.h"
/*********************************************************************************************************
** 函数名称: _ReadyTableInit
** 功能描述: 初始化就绪表
** 输　入  : 
** 输　出  : 
** 全局变量: 
** 调用模块: 
*********************************************************************************************************/
VOID  _ReadyTableInit (VOID)
{
    REGISTER UINT8    ucI;
    REGISTER UINT8    ucJ;
    REGISTER UINT8   *pucReadyTable;

    _K_ucThreadReadyBank = 0x00;                                        /*  没有任务就绪                */

    for (ucI = 0; ucI < __BANK_NUM; ucI++) {
        _K_ucThreadReadyGroup[ucI] = 0x00;
    }

    pucReadyTable = &_K_ucThreadReadyTable[0][0];
    for (ucJ = 0; ucJ < __BANK_NUM; ucJ++) {
        for (ucJ = 0; ucJ < __RDY_TBL_SIZE; ucJ++) {
            *pucReadyTable++ = 0x00;
        }
    }
}
/*********************************************************************************************************
  END
*********************************************************************************************************/
